In [20]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [21]:
df=df.drop(columns=['Pclass','PassengerId','Name', 'SibSp','Parch','Ticket','Cabin', 'Embarked'])

In [22]:
df.head()

   Survived     Sex   Age     Fare
0         0    male  22.0   7.2500
1         1  female  38.0  71.2833
2         1  female  26.0   7.9250
3         1  female  35.0  53.1000
4         0    male  35.0   8.0500

In [24]:
inputs=df.drop(columns=['Survived'])
inputs.head()

      Sex   Age     Fare
0    male  22.0   7.2500
1  female  38.0  71.2833
2  female  26.0   7.9250
3  female  35.0  53.1000
4    male  35.0   8.0500

In [25]:
targets=df.Survived
targets.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [26]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [27]:
inputs=pd.concat([inputs, dummies], axis='columns')

In [31]:
inputs=inputs.drop(columns=['Sex'])
inputs.head()

    Age     Fare  female  male
0  22.0   7.2500       0     1
1  38.0  71.2833       1     0
2  26.0   7.9250       1     0
3  35.0  53.1000       1     0
4  35.0   8.0500       0     1

In [32]:
inputs.columns[inputs.isna().any()]

Index(['Age'], dtype='object')

In [33]:
inputs.Age=inputs.fillna(inputs.Age.mean())
inputs.head()

    Age     Fare  female  male
0  22.0   7.2500       0     1
1  38.0  71.2833       1     0
2  26.0   7.9250       1     0
3  35.0  53.1000       1     0
4  35.0   8.0500       0     1

In [34]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test=train_test_split(inputs, targets, test_size=0.2)

In [36]:
from sklearn.naive_bayes import GaussianNB
model=GaussianNB()

In [37]:
model.fit(x_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [38]:
model.score(x_test, y_test)

0.770949720670391

In [39]:
x_test[:10]

           Age     Fare  female  male
244  30.000000   7.2250       0     1
844  17.000000   8.6625       0     1
457  29.699118  51.8625       1     0
823  27.000000  12.4750       1     0
106  21.000000   7.6500       1     0
566  19.000000   7.8958       0     1
63    4.000000  27.9000       0     1
770  24.000000   9.5000       0     1
222  51.000000   8.0500       0     1
503  37.000000   9.5875       1     0

In [40]:
y_test[:10]

244    0
844    0
457    1
823    1
106    1
566    0
63     0
770    0
222    0
503    0
Name: Survived, dtype: int64

In [41]:
model.predict(x_test[:10])

array([0, 0, 1, 1, 1, 0, 0, 0, 0, 1], dtype=int64)

In [42]:
model.predict_proba(x_test[:10])

array([[0.98129552, 0.01870448],
       [0.97635241, 0.02364759],
       [0.01598524, 0.98401476],
       [0.02662114, 0.97337886],
       [0.02351279, 0.97648721],
       [0.97740704, 0.02259296],
       [0.96168799, 0.03831201],
       [0.97978483, 0.02021517],
       [0.98127731, 0.01872269],
       [0.02893959, 0.97106041]])